matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
//----------------------------------------------------------------------------------
//  FILE:           Solar_DC_DC-Main.C
//
//  Description:    Solar MPPT DC-DC Stage
//                  The file drives duty on PWM1A and PWM2A for DC-DC boost stage on the HV Solar
//                  MPPT board. It also generates 50% duty with dead-band on PWM3A & PWM3B for
//                  the LLC stage on the same board.
//                  C28x ISR is triggered by the PWM 1 interrupt
//
//  Version:        1.0
//
//  Target:         TMS320F2803x(PiccoloB),
//
//----------------------------------------------------------------------------------
//  Copyright Texas Instruments © 2004-2010
//----------------------------------------------------------------------------------
//  Revision History:
//----------------------------------------------------------------------------------
//  Date      | Description / Status
//----------------------------------------------------------------------------------
// March 22 , 2011  - File created (SC)
//----------------------------------------------------------------------------------
//
// PLEASE READ - Useful notes about this Project

// Although this project is made up of several files, the most important ones are:
//   "Solar_DC_DC-Main.C"   - this file
//      - Application Initialization, Peripheral config,
//      - Application management
//      - Slower background code loops and Task scheduling
//   "Solar_DC_DC-DevInit_F28xxx.C
//      - Device Initialization, e.g. Clock, PLL, WD, GPIO mapping
//      - Peripheral clock enables
//      - DevInit file will differ per each F28xxx device series, e.g. F280x, F2833x,
//   "Solar_DC_DC-DPL-ISR.asm
//      - Assembly level library Macros and any cycle critical functions are found here
//   "Solar_DC_DC-Settings.h"
//      - Global defines (settings) project selections are found here
//      - This file is referenced by both C and ASM files.
//
// Code is made up of sections, e.g. "FUNCTION PROTOTYPES", "VARIABLE DECLARATIONS" ,..etc
//  each section has FRAMEWORK and USER areas.
//  FRAMEWORK areas provide useful ready made "infrastructure" code which for the most part
//  does not need modification, e.g. Task scheduling, ISR call, GUI interface support,...etc
//  USER areas have functional example code which can be modified by USER to fit their appl.
//
// Code can be compiled with various build options (Incremental Builds IBx), these
//  options are selected in file "Solar_DC_DC-Settings.h".  Note: "Rebuild All" compile
//  tool bar button must be used if this file is modified.
//----------------------------------------------------------------------------------
#include "PeripheralHeaderIncludes.h"
#include "F2806x_EPWM_defines.h"
#include "Solar_DC_DC-Settings.h"
#include "IQmathLib.h"

#include "SineAnalyzer.h"

#include "DPlib.h"
#include "mppt_incc.h"
#include "mppt_pno.h"

#include "SolarHv_DCDC-Lin.h"

#include <math.h>
#include <stdlib.h>


//#define FLASH

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// FUNCTION PROTOTYPES
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// Add protoypes of functions being used in the project here 
void DeviceInit(void);
void SCIA_Init();
void SerialHostComms();
void InitFlash();
void MemCopy();
//-------------------------------- DPLIB --------------------------------------------
void InitECana(void);
void InitCAN_MB(void);
void PWM_1ch_UpDwnCnt_CNF(int16 n, int16 period, int16 mode, int16 phase);
void PWM_2ch_UpDwnCnt_CNF(int16 n, int16 period, int16 phase);// Added 2-ch mode for PWM A and B outputs
void PWM_ComplPairDB_CNF(int16 n, int16 period, int16 mode, int16 phase);
void PWM_ComplPairDB_UpdateDB(int16 n, int16 dbRED, int16 dbFED);
void ADC_SOC_CNF(int ChSel[], int TrigSel[], int ACQPS[], int IntChSel, int mode);

interrupt void SECONDARY_ISR(void);
// -------------------------------- FRAMEWORK --------------------------------------
// State Machine function prototypes
//----------------------------------------------------------------------------------
// Alpha states
void A0(void);  //state A0
void B0(void);  //state B0
void C0(void);  //state C0

// A branch states
void A1(void);  //state A1
void A2(void);  //state A2
void A3(void);  //state A3
void A4(void);  //state A4

// B branch states
void B1(void);  //state B1
void B2(void);  //state B2

// C branch states
void C1(void);  //state C1
void C2(void);  //state C2
void C3(void);  //state C3
void C4(void);  //state C4

// Variable declarations
void (*Alpha_State_Ptr)(void);  // Base States pointer
void (*A_Task_Ptr)(void);       // State pointer A branch
void (*B_Task_Ptr)(void);       // State pointer B branch
void (*C_Task_Ptr)(void);       // State pointer C branch

//Initialization functions
void Configure_PWM(void);
void Configure_ADC(void);

//LED Control & defines
#define LED_W_BR    0
#define LED_R_BR    1
#define LED_G_BR    2
#define LED_B_BR    3
#define LED_ORG_BR  4
#define LED_CYA_BR  5
#define LED_MAG_BR  6
#define LED_YEL_BR  7
#define LED_R_FL    8

//CAN parameter defines
#define CAN_MAX_UNACK   10
#define HTSK_OHVAL      32768

Uint16 ledSetMode;      //Variable for setting LED Display mode
Uint16 fade;            //Fade counter for breathing LED
Uint16 fade_dir;        //Direction for LED fading, 0 up, 1 down

Uint16 CAN_noACK;       //Counter for number of non-acknowledged CAN messages

Uint16 HTSK_TP;         //Heatsink temperature probe
Uint16 EXTHTSK_TP;         //Heatsink temperature probe

void RGBWSetColor(Uint16 redDuty, Uint16 greenDuty, Uint16 blueDuty, Uint16 whiteDuty);
void RGBModeControl(Uint16 DisplayMode);

//----------------------------------------------------------------------------------

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// VARIABLE DECLARATIONS - GENERAL
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

// -------------------------------- FRAMEWORK --------------------------------------
int16 VTimer0[4];   // Virtual Timers slaved off CPU Timer 0
int16 VTimer1[4];   // Virtual Timers slaved off CPU Timer 1
int16 VTimer2[4];   // Virtual Timers slaved off CPU Timer 2

