matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
int16   SerialCommsTimer;
int16   CommsOKflg;

// Used for running BackGround in flash, and ISR in RAM
extern Uint16 *RamfuncsLoadStart, *RamfuncsLoadEnd, *RamfuncsRunStart;

// Used for ADC Configuration 
int ChSel[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
int TrigSel[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
int ACQPS[16] = {6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6};

//---------------------------------------------------------------------------
// Used to indirectly access all EPWM modules
volatile struct EPWM_REGS *ePWM[] = 
                  { &EPwm1Regs,         //intentional: (ePWM[0] not used)
                    &EPwm1Regs,
                    &EPwm2Regs,
                    &EPwm3Regs,
                    &EPwm4Regs,
                    &EPwm5Regs,
                    &EPwm6Regs,
                    &EPwm7Regs,
                  };

// Used to indirectly access all Comparator modules
volatile struct COMP_REGS *Comp[] = 
                  { &Comp1Regs,         //intentional: (Comp[0] not used)
                    &Comp1Regs,
                    &Comp2Regs,
                    &Comp3Regs
                  };
// ---------------------------------- USER -----------------------------------------

//long Pgain;               // PID P gain
//long Igain;               // PID I gain
//long Dgain;               // PID D gain
long Dmax_I;


// ---------------------------- DPLIB Net Pointers ---------------------------------
// Declare net pointers that are used to connect the DP Lib Macros  here 

// ADC
extern volatile long *ADCDRV_1ch_Rlt1;  // instance #1, IL
extern volatile long *ADCDRV_1ch_Rlt2;  // instance #2, Vb, Boost output volt
extern volatile long *ADCDRV_1ch_Rlt3;  // instance #3, Vp, Panel output volt
extern volatile long *ADCDRV_1ch_Rlt4;  // instance #4, Ics, LLC stage primary current

// CONTROL_2P2Z
extern volatile long *CNTL_2P2Z_Ref1;   // instance #1
extern volatile long *CNTL_2P2Z_Out1;   // instance #1
extern volatile long *CNTL_2P2Z_Fdbk1;  // instance #1
extern volatile long *CNTL_2P2Z_Coef1;  // instance #1
extern volatile long CNTL_2P2Z_DBUFF1[5];

// CONTROL_2P2Z
extern volatile long *CNTL_2P2Z_Ref2;   // instance #2
extern volatile long *CNTL_2P2Z_Out2;   // instance #2
extern volatile long *CNTL_2P2Z_Fdbk2;  // instance #2
extern volatile long *CNTL_2P2Z_Coef2;  // instance #2
extern volatile long CNTL_2P2Z_DBUFF2[5];

// Boost-ch1
extern volatile long *PWMDRV_1ch_UpDwnCnt_Duty1;    // instance #1, EPWM1
// Boost-ch2
extern volatile long *PWMDRV_1ch_UpDwnCnt_Duty2;    // instance #2, EPWM2
// Instrumentation-ch4
extern volatile long *PWMDRV_1ch_UpDwnCnt_Duty4;    // instance #3, EPWM4



// Instrumentation-ch4
extern volatile long *PWMDRV_1ch_UpDwnCnt_Duty6;    // instance #4, EPWM6




extern volatile long *PWMDRV_LLC_ComplPairDB_Duty3;
extern volatile long *PWMDRV_LLC_ComplPairDB_Period3;
extern volatile long *PWMDRV_LLC_ComplPairDB_DeadBandRED3;
extern volatile long *PWMDRV_LLC_ComplPairDB_DeadBandFED3;

//MATH_AVG - instance #1
extern volatile long *MATH_EMAVG_In1;
extern volatile long *MATH_EMAVG_Out1;
extern volatile long MATH_EMAVG_Multiplier1;

//MATH_AVG - instance #2
extern volatile long *MATH_EMAVG_In2;
extern volatile long *MATH_EMAVG_Out2;
extern volatile long MATH_EMAVG_Multiplier2;


// ---------------------------- DPLIB Variables ---------------------------------
// Declare the net variables being used by the DP Lib Macro here 
volatile long IL_raw, IL,Ics; 
volatile long IL_avg; 
volatile long Vb_fb,Vb_fb_Avg; //Boost output volt
volatile long Vp_fb,Vp_fb_Avg; //Panel output volt

volatile long DutyA, DutyLLC; 
volatile long Vp_fb, Boost_IL_cmd;
volatile long Duty4A;
volatile long VpvRef,VpvRef_MPPT; // Set point for the Panel volt
volatile long PanelPower, PanelPower_Prev, Powerdiff;


long    temp_zero;

int16   periodLLC, dbred, dbfed, db_dly_cntr, soft_start;


#pragma DATA_SECTION(CNTL_2P2Z_CoefStruct1, "CNTL_2P2Z_Coef"); 
#pragma DATA_SECTION(CNTL_2P2Z_CoefStruct2, "CNTL_2P2Z_Coef"); 
struct CNTL_2P2Z_CoefStruct CNTL_2P2Z_CoefStruct1;
struct CNTL_2P2Z_CoefStruct CNTL_2P2Z_CoefStruct2;

long Pgain_I,Igain_I,Dgain_I,Dmax_I;
long Pgain_V,Igain_V,Dgain_V,Dmax_V;

// MPPT tracking , declare both PnO and Incc objects so that comparisons can be done
// Instance for mppt incremental conductance loop
mppt_incc mppt_incc1 = mppt_incc_DEFAULTS;
mppt_pno  mppt_pno1 = mppt_pno_DEFAULTS;

int16 MPPT_slew, inverter_connected, inverter_mode;
int16 Enable_mppt, GPIO_status, Operation_mode, LLC_PWM_ON, GPIO_cnt, Start_DC_DC;

int16   Run_MPPT;
int16   mppt_firstTime;
int16   perturbation_direction;
int16   Gui_Powerdiff;
int16   Gui_PanelPower_Prev;

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// VARIABLE DECLARATIONS - CCS WatchWindow / GUI support
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

// -------------------------------- FRAMEWORK --------------------------------------

//GUI support variables
// sets a limit on the amount of external GUI controls - increase as necessary
int16 *varSetTxtList[16];   //16 textbox controlled variables
int16 *varSetBtnList[16];   //16 button controlled variables
int16 *varSetSldrList[16];  //16 slider controlled variables
int16 *varGetList[16];      //16 variables sendable to GUI
int16 *arrayGetList[16];    //16 arrays sendable to GUI
int16 LedBlinkCnt;

// ---------------------------------- USER -----------------------------------------

// Monitor ("Get")  // Display as:
//Uint16 Gui_IL;    // Q11
int16 Gui_Vb_fb;    // Q06. Variable used for displaying Vb on DC-DC GUI
int16 Inv_Gui_Vb_fb;//Variable used for communicating and displaying Vb on Inverter GUI

int16 Gui_PanelPower; 
int16 Inv_Gui_PanelPower; 

//int16 Gui_Ipv;
//int16 Gui_Vpv;

int16 Gui_IL_avg;//Variable used for displaying average IL (panel current) on DC-DC GUI
int16 Inv_Gui_IL_avg;//Variable used for communicating and displaying average IL (panel current) on Inverter GUI

int16 Gui_Vp_fb;//Variable used for displaying Vp (panel volt) on DC-DC GUI
int16 Inv_Gui_Vp_fb;//Variable used for communicating and displaying Vp (panel volt) on Inverter GUI

// Configure ("Set")
//int16     Gui_Vp_fb_set;
int16   Gui_Operation_mode;
int16   Gui_inverter_connected;
int16   Gui_inverter_mode;

// History arrays are used for Running Average calculation (boxcar filter)
// HistorySize is defined in Solar_DC_DC_Settings.h file
// Used for CCS display and GUI only, not part of control loop processing
Uint16 Hist_IL[HistorySize];
Uint16 Hist_Vb_fb[HistorySize];
Uint16 Hist_Vp_fb[HistorySize];
//Uint16 Hist_Ics[HistorySize];
//Uint16 Hist_VrectRMS[HistorySize];
//Uint16 Hist_Freq_Vin[HistorySize];
//Uint16 Hist_KDCM[HistorySize];

//Scaling Constants (exact value calibrated per board)associated with variables used for DC-DC side GUI
Uint16 K_IL_avg;    //
Uint16 K_Vb_fb; //
Uint16 K_Vp_fb; //

//Scaling Constants associated with variables used for Inverter side GUI
Uint16 Kinv_IL_avg; //
Uint16 Kinv_Vb_fb;  //
Uint16 Kinv_Vp_fb;  //


// Variables for background support only (no need to access)
int16 i;                        // common use incrementer
Uint32 HistPtr, temp_Scratch;   // Temp here means Temporary


//
int LinDebugLED=0;
long LinDebugTimer = 0;
Uint32 LinL0IntCount;

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// MAIN CODE - starts here
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
void main(void)
{
//=================================================================================
//  INITIALIZATION - General
//=================================================================================

