matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
    // The DeviceInit() configures the clocks and pin mux registers
    // The function is declared in Solar_DC_DC-DevInit_F2803/2x.c,
    // Please ensure/edit that all the desired components pin muxes
    // are configured properly that clocks for the peripherals used
    // are enabled, for example the individual PWM clock must be enabled
    // along with the Time Base Clock


//-------------------------------- FRAMEWORK --------------------------------------

// Only used if running from FLASH
// Note that the variable FLASH is defined by the compiler with -d FLASH

//MemCopy(&RamfuncsLoadStart, &RamfuncsLoadEnd, &RamfuncsRunStart);

//#ifdef FLASH
// Copy time critical code and Flash setup code to RAM
// The  RamfuncsLoadStart, RamfuncsLoadEnd, and RamfuncsRunStart
// symbols are created by the linker. Refer to the linker files. 
    MemCopy(&RamfuncsLoadStart, &RamfuncsLoadEnd, &RamfuncsRunStart);
    //memcpy(&secureRamFuncs_runstart, &secureRamFuncs_loadstart, (Uint32)&secureRamFuncs_loadsize);
// Call Flash Initialization to setup flash waitstates
// This function must reside in RAM
    InitFlash();    // Call the flash wrapper init function
//#endif //(FLASH)

//#ifdef FLASH
    SCIA_Init();    // Initalize the Serial Comms A peripheral - Uncomment for FLASH config
//#endif //(FLASH)


    DeviceInit();   // Device Life support & GPIO
// Timing sync for background loops
// Timer period definitions found in PeripheralHeaderIncludes.h
    CpuTimer0Regs.PRD.all =  mSec1;     // A tasks
    CpuTimer1Regs.PRD.all =  mSec500;    // B tasks
    CpuTimer2Regs.PRD.all =  mSec5;    // C tasks

// Tasks State-machine init
    Alpha_State_Ptr = &A0;
    A_Task_Ptr = &A1;
    B_Task_Ptr = &B1;
    C_Task_Ptr = &C1;

    VTimer0[0] = 0;
    VTimer1[0] = 0;
    VTimer2[0] = 0;
    LedBlinkCnt = 5;

#ifdef  FLASH
    CommsOKflg = 0;
    SerialCommsTimer = 0;
#endif

    Gui_wPanelVolt = &Inv_Gui_Vp_fb;
    Gui_wPanelCurrent = &Inv_Gui_IL_avg;
    Gui_wBoostOutputVolt = &Inv_Gui_Vb_fb;
    Gui_wPanelOutputPower = &Inv_Gui_PanelPower;
    Gui_wMPPT_Status = &Operation_mode;


    //"Set" variables
    //---------------------------------------
    // assign GUI variable Textboxes to desired "setable" parameter addresses


// ---------------------------------- USER -----------------------------------------
//  put common initialization/variable definitions here

    K_IL_avg=19455;
    Kinv_IL_avg=(19455.0*100.0)/2048.0;
    K_Vb_fb=32959;//K_Vb_fb=(515/512)*32767 = 32959;
    Kinv_Vb_fb=(32959.0*10.0)/64.0;

    K_Vp_fb=32767;  // K_Vp_fb=(512/512)*32767 = 32767; 15-bit GUI variable Gui_Vp_fb is denoted in Q6
    Kinv_Vp_fb=(32767.0*10.0)/64.0;

    dbred=25;//Initialize dead band for LLC PWM
    dbfed=25;
    db_dly_cntr=0;

//===============================================================================
//  INITIALISATION - GUI connections
//=================================================================================
// Use this section only if you plan to "Instrument" your application using the 
// Microsoft C# freeware GUI Template provided by TI

    //"Set" variables
    //---------------------------------------
    // assign GUI variable Textboxes to desired "setable" parameter addresses
//  varSetTxtList[0] = &Gui_Vp_fb_set;
    varSetTxtList[0] = &Operation_mode;
    varSetTxtList[1] = &inverter_connected;


    //"Get" variables
    //---------------------------------------
    // assign a GUI "getable" parameter address
    varGetList[0] = &Gui_Vb_fb;
    varGetList[1] = &Gui_Vp_fb;
    varGetList[2] = &Gui_IL_avg;
    varGetList[3] = &Gui_PanelPower;
    varGetList[4] = &Operation_mode;
    varGetList[5] = &inverter_mode;


//==================================================================================
//  INCREMENTAL BUILD OPTIONS - NOTE: selected via {Solar_DC_DC-Settings.h
//==================================================================================
// ---------------------------------- USER -----------------------------------------


    Configure_PWM();

    Configure_ADC();

    fade_dir = 0;
    fade = 0;
    ledSetMode = LED_W_BR;

    CAN_noACK = CAN_MAX_UNACK; //Initially set CAN to not online

    HTSK_TP = 0;
    EXTHTSK_TP = 0;

    DPL_Init();
//--------------------------------------------------------------------------------
//----------------------------------------------------------------------
#if (INCR_BUILD == 3)   // Closed Current Loop & closed input volt loop dc-dc boost(Panel Volt Output,
                        // or, DC-DC Boost Volt Input)
//----------------------------------------------------------------------
// Lib Module connection to "nets" 
    //----------------------------------------
    // Connect the PWM Driver input to an input variable, Open Loop System
    ADCDRV_1ch_Rlt1 = &IL_raw;
    ADCDRV_1ch_Rlt2 = &Vb_fb;
    ADCDRV_1ch_Rlt3 = &Vp_fb;
    ADCDRV_1ch_Rlt4 = &Ics;

    // Math_avg block connections - Instance 1
    MATH_EMAVG_In1=&IL_raw;
    //MATH_EMAVG_In1=&IL;
    MATH_EMAVG_Out1=&IL_avg;
    MATH_EMAVG_Multiplier1=_IQ30(0.008);//(0.030);

    // Math_avg block connections - Instance 2
    MATH_EMAVG_In2=&Vp_fb;//&Vb_fb;
    MATH_EMAVG_Out2=&Vp_fb_Avg;//&Vb_fb_Avg;
    MATH_EMAVG_Multiplier2=_IQ30(0.008);//(0.00025);

        //connect the 2P2Z connections, for the inner Current Loop, Loop1
    CNTL_2P2Z_Ref1 = &Boost_IL_cmd;
    CNTL_2P2Z_Out1 = &DutyA;
    CNTL_2P2Z_Fdbk1= &IL_raw;
    //CNTL_2P2Z_Fdbk1= &IL;
    CNTL_2P2Z_Coef1 = &CNTL_2P2Z_CoefStruct1.b2;


    //Connect the 2P2Z connections, for the voltage loop for Vin (panel voltage) control, Loop2.
    //*******This volt loop has +ve feedback (compared to the conventional -ve feedback) since for higher Vin, i.e., panel volt
    //we want higher control output, i.e., in this case higher boost current and vice versa. Thus the net
    //connections below are reversed for feedback and reference terminals**************
    CNTL_2P2Z_Fdbk2 = &VpvRef;//PV panel reference(VpvRef) is connected to the controller feedback net (CNTL_2P2Z_Fdbk2)
    CNTL_2P2Z_Out2 = &Boost_IL_cmd;
    CNTL_2P2Z_Ref2= &Vp_fb;//PV panel feedback(Vp_fb) is connected to the controller reference net (CNTL_2P2Z_Ref2)
    CNTL_2P2Z_Coef2 = &CNTL_2P2Z_CoefStruct2.b2;

