matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
    PWMDRV_1ch_UpDwnCnt_Duty1 = &DutyA;
    PWMDRV_1ch_UpDwnCnt_Duty2 = &DutyA;


    // Initialize the net variables
    DutyA =_IQ24(0.0);
    Duty4A =_IQ24(0.0);
    IL_avg = _IQ24(0.0);
    IL = _IQ24(0.0);
    IL_raw = _IQ24(0.0);
    Vb_fb_Avg = _IQ24(0.0);
    Boost_IL_cmd = _IQ24(0.0);
    Vp_fb = _IQ24(0.9);
    Vp_fb_Avg = _IQ24(0.9);
    VpvRef = _IQ24(0.9);
    temp_zero = 0;
    Operation_mode = 0;//DC-DC stage status flag. 
                 //Operation_mode = 0 =>Boost OFF & LLC ON, Operation_mode = 1 =>Boost ON & LLC ON
                 //Operation_mode = 2 =>Boost OFF & LLC OFF,
    
    LLC_PWM_ON = 0;//LLC initially off. Set this flag to 1 after soft-start.
    //LLC_PWM_ON = 1;//Used as LLC PWM status flag. Initialized to 1 since LLC PWM is initially ON
    
    soft_start = 0;
    
    GPIO_cnt = 0; //Used as a delay counter before starting MPPT
    
    Start_DC_DC = 0;
    




    //////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////
    inverter_connected = 0; //Default setting is 1, implying that inverter is connected.
    //////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////



    inverter_mode = 0;//Used for showing EVM status (whether the inverter is connected or not)
    
    //--------------------------------------------------------------------------------
    // Coefficients for Inner Current Loop
    //--------------------------------------------------------------------------------
    // Coefficients for Inner Current Loop
    // PID coefficients & Clamp values - Current loop (Q26), 100kHz Cloop sampling
    


    /////////////////////////////////////////////////////////////////////////////
    Dmax_I  = _IQ24(0.75); //Min Vin=200V, Max Vout=400V, Therefore Boost PWM max duty = 0.5
    /////////////////////////////////////////////////////////////////////////////


    CNTL_2P2Z_CoefStruct1.b2   =_IQ26(0.06721);// B2
    CNTL_2P2Z_CoefStruct1.b1   =_IQ26(-0.208);// B1
    CNTL_2P2Z_CoefStruct1.b0   =_IQ26(0.1432);  // B0

    CNTL_2P2Z_CoefStruct1.a2   =_IQ26(-0.028);                         // A2 = 0
    CNTL_2P2Z_CoefStruct1.a1   =_IQ26(1.028);                           // A1 = 1
    CNTL_2P2Z_CoefStruct1.max  = Dmax_I;                                //Clamp Hi
    CNTL_2P2Z_CoefStruct1.min  =_IQ24(0.0);                         //Clamp Min


//------------------------------------------------------------------------------
// Coefficients for Voltage Loop - Regulates Boost Input Volt dictated by MPPT algo
//------------------------------------------------------------------------------
    // PID coefficients & Clamp values - Voltage loop (Q26), 50kHz Vloop sampling




//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    Dmax_V  = _IQ24(0.765);//Max output from Vloop controller sets the Max boost current. At 200Vin, 550W input, Iboost=2.625A
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //Max boost current is 9.1A (set by the CS amplifier gain of 39.2 and CS sense resistor 0.01 ohm). Therefore,
    //per unit boost current max value is limited to 2.625/9.1 = 0.2885. Add 10% margin => Max current = 0.31 pu




    Pgain_V = _IQ26(0.25);//
    Igain_V = _IQ26(0.0005);//(0.015);//0.0002//(0.0001);
    Dgain_V =_IQ26(0.0);  //


    // Coefficient init --- Coeeficient values in Q26
    // Use IQ Maths to generate floating point values for the CLA
    CNTL_2P2Z_CoefStruct2.b2   =Dgain_V;                            // B2
    CNTL_2P2Z_CoefStruct2.b1   =(Igain_V-Pgain_V-Dgain_V-Dgain_V);  // B1
    CNTL_2P2Z_CoefStruct2.b0   =(Pgain_V + Igain_V + Dgain_V);      // B0
    CNTL_2P2Z_CoefStruct2.a2   =0.0;                                // A2 = 0
    CNTL_2P2Z_CoefStruct2.a1   =_IQ26(1.0);                         // A1 = 1
    CNTL_2P2Z_CoefStruct2.max  =Dmax_V;                             //Clamp Hi
    CNTL_2P2Z_CoefStruct2.min  =_IQ24(0.0);                         //Clamp Min

    // MPPT testing related code
    // mppt incc
    mppt_incc1.IpvH = _IQ(0.0001);
    mppt_incc1.IpvL = _IQ(-0.0001);
    mppt_incc1.VpvH = _IQ(0.0001);
    mppt_incc1.VpvL = _IQ(-0.0001);
    mppt_incc1.MaxVolt = _IQ(0.9);
    mppt_incc1.MinVolt = _IQ(0.0);
    mppt_incc1.Stepsize = _IQ(0.001);
    mppt_incc1.mppt_first=1;
    mppt_incc1.mppt_enable=0;
    
    //mppt pno
    mppt_pno1.DeltaPmin = _IQ(0.00001);
    mppt_pno1.MaxVolt = _IQ(0.9);
    mppt_pno1.MinVolt = _IQ(0.0);
    mppt_pno1.Stepsize = _IQ(0.001);

#endif // (INCR_BUILD == 3),
//----------------------------------------------------------------------
//--------------------------------------------------------------------------------


    mppt_firstTime=1;
    Run_MPPT=0;
    Gui_Powerdiff=_IQ6(0.0);
    Gui_PanelPower_Prev=_IQ6(0.0);
    Powerdiff=_IQ24(0.0);
    PanelPower_Prev=_IQ24(0.0);
    VpvRef_MPPT=_IQ24(0.0);
    perturbation_direction=0;
    MPPT_slew=0;
    Enable_mppt=0;
    GPIO_status=1;//Initialize this to 1 to keep MPPT diabled on power up until we get a LOW GPIO
                    // signal(GPIO16) from the inverter board


//--------------------------------------------------------------------------------


        EALLOW;
//Activate /TZ1 under s/w control to shut off PWM1A, PWM2A under DC bus overvoltage condition
        //EPwm1Regs.TZSEL.bit.OSHT1 = 1;
        //EPwm2Regs.TZSEL.bit.OSHT1 = 1;
        EPwm3Regs.TZSEL.bit.OSHT1 = 1;

//Use Comparator 3 (associated with ADC-A6) to implement Cycle by cycle trip on Vbus (boost stage)overvoltage
        Comp3Regs.COMPCTL.bit.COMPDACEN  =0x1;
        Comp3Regs.COMPCTL.bit.SYNCSEL    =0x0;  // asynchronous version of the COMP signal is passed to the EPWM/GPIO module
        Comp3Regs.COMPCTL.bit.CMPINV     =0x0;  // Output of the comparator is passed directly
        Comp3Regs.COMPCTL.bit.COMPSOURCE =0x0;  // inverting input of the comparator is connected to the internal DAC
        Comp3Regs.DACVAL.bit.DACVAL      =808; //Set DAC input to peak Vout (Boost stage) OVP Threshold
                                                //400; //1023*(200V/511V)=400<=>200V @Boost Vout,
                                                // 652; //1023*(326V/511V)=652<=>326V @Boost Vout
                                                // 701; //1023*(350V/511V)=701<=>350V @Boost Vout
                                                // 760; //1023*(380V/511V)=760<=>380V @Boost Vout
                                                // 808; //1023*(404V/511V)=808<=>404V @Boost Vout
                                                // 840; //1023*(420V/511V)=840<=>420V @Boost Vout

        AdcRegs.COMPHYSTCTL.bit.COMP3_HYST_DISABLE = 0x1;

// Cycle by cycle trip for overvoltage protection
        EPwm1Regs.DCTRIPSEL.bit.DCAHCOMPSEL=DC_COMP3OUT;
        EPwm1Regs.TZDCSEL.bit.DCAEVT2=TZ_DCAH_HI;
        EPwm1Regs.DCACTL.bit.EVT2SRCSEL = DC_EVT2;
        EPwm1Regs.DCACTL.bit.EVT2FRCSYNCSEL=DC_EVT_ASYNC;
        EPwm1Regs.TZSEL.bit.DCAEVT2=0x1;

        EPwm2Regs.DCTRIPSEL.bit.DCAHCOMPSEL=DC_COMP3OUT;
        EPwm2Regs.TZDCSEL.bit.DCAEVT2=TZ_DCAH_HI;
        EPwm2Regs.DCACTL.bit.EVT2SRCSEL = DC_EVT2;
        EPwm2Regs.DCACTL.bit.EVT2FRCSYNCSEL=DC_EVT_ASYNC;
        EPwm2Regs.TZSEL.bit.DCAEVT2=0x1;


        // Cycle by cycle interrupt for CPU halt trip
        EPwm3Regs.TZSEL.bit.CBC6=0x1;
        EPwm1Regs.TZSEL.bit.CBC6=0x1;
        EPwm2Regs.TZSEL.bit.CBC6=0x1;

// What do we want the OST/CBC events to do?
// TZA events can force EPWMxA
// TZB events can force EPWMxB
        EPwm3Regs.TZCTL.bit.TZA = TZ_FORCE_LO; // EPWM3A will go low
        EPwm3Regs.TZCTL.bit.TZB = TZ_FORCE_LO; // EPWM3B will go low

        EPwm1Regs.TZCTL.bit.TZA = TZ_FORCE_LO; // EPWM1A will go low
        EPwm1Regs.TZCTL.bit.TZB = TZ_FORCE_LO; // EPWM1B will go low

        EPwm2Regs.TZCTL.bit.TZA = TZ_FORCE_LO; // EPWM2A will go low
        EPwm2Regs.TZCTL.bit.TZB = TZ_FORCE_LO; // EPWM2B will go low

        EDIS;

