matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
//=================================================================================
//  LIN INITIALIZATION
//=================================================================================
    LinL0IntVect  = 0;

    //InitLinaGpio();
    EALLOW;
    GpioCtrlRegs.GPAPUD.bit.GPIO22 = 0;     // Enable pull-up for GPIO9 (LIN TX)
    GpioCtrlRegs.GPAPUD.bit.GPIO23 = 0;     // Enable pull-up for GPIO11 (LIN RX)
    GpioCtrlRegs.GPAQSEL2.bit.GPIO23 = 3;  // Asynch input GPIO11 (LINRXA)

/* Configure LIN-A pins using GPIO regs*/
    GpioCtrlRegs.GPAMUX2.bit.GPIO22 = 3;    // Configure GPIO9 for LIN TX operation (2-Enable,0-Disable)
    GpioCtrlRegs.GPAMUX2.bit.GPIO23 = 3;   // Configure GPIO11 for LIN RX operation  (2-Enable,0-Disable)
    EDIS;

    //Initialize and Enable BLIN SCI module
    SetupLin();

    sdataALin = 0;
    rdataALin = 0;

    RcvTaskPointerLin = &GetCmdByteLin;         // Initialize the CmdPacket Rcv Handler state machine ptr

    // clear Command Packet
    for (iLin=0; iLin<PktSizeLin; iLin++)
    {
        CmdPacketLin[iLin] = 0x0;
    }

//=================================================================================
//  CAN INITIALIZATION
//=================================================================================

    InitCAN_MB();


//====================================================================================
// INTERRUPTS & ISR INITIALIZATION (best to run this section after other initialization)
//====================================================================================

//Also Set the appropriate # define's in the Solar_DC_DC-Settings.h 
//to enable interrupt management in the ISR
    EALLOW;
// Set up C28x Interrupt

// ADC EOC based ISR trigger
//  PieVectTable.ADCINT1 = &DPL_ISR;            // Map Interrupt
//  PieCtrlRegs.PIEIER1.bit.INTx1 = 1;          // PIE level enable, Grp1 / Int1, ADCINT1
//  AdcRegs.INTSEL1N2.bit.INT1SEL = 4;          // ADC Channel 4 EOC causes ADCInterrupt 1
//  IER |= M_INT1;                              // Enable CPU INT1 group:

// PWM based ISR trigger
    PieVectTable.EPWM1_INT = &DPL_ISR;          // Map Interrupt
    //PieVectTable.LIN0INTA  = &Lina_Level0_ISR;
    PieCtrlRegs.PIEIER3.bit.INTx1 = 1;          // PIE level enable, Grp3 / Int1, ePWM1
    //LIN Interrupt
    PieCtrlRegs.PIEIER9.bit.INTx3=1;     // PIE Group 9, INT3

    EPwm1Regs.CMPB = 80;                        // ISR trigger point
    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTRU_CMPB;  // INT on CompareB-Up event
    EPwm1Regs.ETSEL.bit.INTEN = 1;              // Enable INT
 //   EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;         // Generate INT on every event

    EPwm1Regs.ETPS.bit.INTPRD = ET_2ND;         // Generate INT on every event
    // Enable Peripheral, global Ints and higher priority real-time debug events:
    IER = 0x100;    // Enable CPU INT
    IER |= M_INT1;
    IER |= M_INT3;                              // Enable CPU INT3 connected to EPWM1-6 INTs:
     
    EINT;                                       // Enable Global interrupt INTM
    ERTM;                                       // Enable Global realtime interrupt DBGM
    EDIS;



    //Wait for SCI to be idle and ready for transmission
    //while(LinaRegs.SCIFLR.bit.IDLE == 1);
//=================================================================================
//  BACKGROUND (BG) LOOP
//=================================================================================

//--------------------------------- FRAMEWORK -------------------------------------
    for(;;)  //infinite loop
    {

        /////////////////
        // State machine entry & exit point
        //===========================================================
        (*Alpha_State_Ptr)();   // jump to an Alpha state (A0,B0,...)
        //===========================================================

    }
} //END MAIN CODE
//============================================================================================

//=============================================================================================
// CONFIG : Function Call to configure PWM Module on startup
//=============================================================================================
void Configure_PWM(void){

#define period 600  //600 cycles -> 100KHz @60MHz CPU, PWM period for 2Ph Interleaved Boost stage
#define phase 300   //Phase shift for slave PWM in 2Ph IL Boost stage
#define period_LLC 500 //545=>110kHz,,460=>130kHz, 500 cycles -> LLC freq 120KHz @60MHz CPU

#define period_LLC_HI 448 //448 =>134kHz, -> LLC freq 134KHz @60MHz CPU

#define period_instr_pwm 120    //120 => 500k @60MHz CPU, period for PWM channels used for instrumentation

#define period_LED 30000    //2KHz @60Mhz CPU, PWM period for LED dimming

    // Configure PWM1 for 100Khz switching Frequency
    PWM_1ch_UpDwnCnt_CNF(1, period, 1, 0);
    // Configure PWM2 for 100Khz switching Frequency
    PWM_1ch_UpDwnCnt_CNF(2, period, 0, 300);

    //Configure PWM4 for 1KHz LED dimming
    PWM_2ch_UpDwnCnt_CNF(4, period_LED, 0);
    //Configure PWM6 for 1KHz LED dimming
    PWM_2ch_UpDwnCnt_CNF(6, period_LED, 0);

    (*ePWM[4]).CMPA.half.CMPA = 0;//period_LED/32;
    (*ePWM[4]).CMPB = 0;

    (*ePWM[6]).CMPA.half.CMPA = 0;//period_LED/32;
    (*ePWM[6]).CMPB = 0;


    PWM_ComplPairDB_CNF(3, period_LLC_HI, 1, 0);
    (*ePWM[3]).CMPA.half.CMPA = period_LLC_HI/2;

    if((INCR_BUILD == 1)||(INCR_BUILD == 2))
    {
        PWM_ComplPairDB_CNF(3, period_LLC, 1, 0);
        (*ePWM[3]).CMPA.half.CMPA = period_LLC/2;
        PWM_ComplPairDB_UpdateDB(3,dbred,dbred);
    }

    if(INCR_BUILD == 3)
    {
        dbred = (period_LLC_HI/2)-50;
        PWM_ComplPairDB_UpdateDB(3,dbred,dbred);//For Build 3, set low initial value of LLC duty using higher DB
    }

    EALLOW;
    SysCtrlRegs.PCLKCR1.bit.EPWM7ENCLK = 1;  // ePWM7
// Setup TBCLK
    EPwm7Regs.TBPRD = 3000;           // Set timer period 3000 TBCLKs
    EPwm7Regs.TBPHS.half.TBPHS = 0x0000;           // Phase is 0
    EPwm7Regs.TBCTR = 0x0000;                      // Clear counter
// Setup counter mode
    EPwm7Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN; // Count up
    EPwm7Regs.TBCTL.bit.PHSEN = TB_DISABLE;        // Disable phase loading
    EPwm7Regs.TBCTL.bit.HSPCLKDIV = TB_DIV1;       // Clock ratio to SYSCLKOUT
    EPwm7Regs.TBCTL.bit.CLKDIV = TB_DIV1;
    EPwm7Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;
// Configure the Start of Conversion for the ADC.
    EPwm7Regs.ETSEL.bit.INTEN = 1;               //
    EPwm7Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;   // Select Int from counter = PRD
    EPwm7Regs.ETPS.bit.INTPRD = ET_1ST;        // Generate pulse on 1st event

    PieVectTable.EPWM7_INT  = &SECONDARY_ISR;
    IER   |= M_INT3;                                // Enable CPU INT3 for capture interrupt
    PieCtrlRegs.PIEIER3.bit.INTx7       = 1;  // Enable EPWM7 int in PIE group 3
    EDIS;

