matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
}
//=========================================================================================================
//End of Main PWM Config
//==========================================================================================================


//=============================================================================================
// CONFIG : Function Call to configure ADC Module on startup
//=============================================================================================
void Configure_ADC(void){

#define     ILR         AdcResult.ADCRESULT1        //Q12
#define     Vb_fbR      AdcResult.ADCRESULT2        //Q12
#define     Vp_fbR      AdcResult.ADCRESULT3        //Q12
#define     IcsR        AdcResult.ADCRESULT4        //Q12
#define     Thrm_Htsk   AdcResult.ADCRESULT5        //Q12

            // ADC Channel Selection for C2000EVM
    ChSel[0] = 2;       // Dummy read for first
    ChSel[1] = 2;       // A2 - ILb_fb, Boost inductor current
    ChSel[2] = 1;       // A1 - Vb_fb, Boost output volt
    ChSel[3] = 0;       // A0 - Vp_fb, Panel voltage
    ChSel[4] = 4;       // A4 - Ics_fb, LLC stage primary current
    ChSel[5] = 7;       // A7 - Thermocouple

    // ADC Trigger Selection
    TrigSel[0] = ADCTRIG_EPWM1_SOCA;    // ePWM1, ADCSOCA
    TrigSel[1] = ADCTRIG_EPWM1_SOCA;    // ePWM1, ADCSOCA
    TrigSel[2] = ADCTRIG_EPWM1_SOCA;    // ePWM1, ADCSOCA
    TrigSel[3] = ADCTRIG_EPWM1_SOCA;    // ePWM1, ADCSOCA
    TrigSel[4] = ADCTRIG_EPWM1_SOCA;    // ePWM1, ADCSOCA
    TrigSel[5] = ADCTRIG_EPWM1_SOCA;    // ePWM1, ADCSOCA

    // Configure ADC
    ADC_SOC_CNF(ChSel, TrigSel, ACQPS, 17, 0);

    // Configure ePWMs to generate ADC SOC pulses
    EPwm1Regs.ETSEL.bit.SOCAEN = 1;                 // Enable ePWM1 SOCA pulse
    EPwm1Regs.ETSEL.bit.SOCASEL = ET_CTR_ZERO;      // SOCA from ePWM1 Zero event
    EPwm1Regs.ETPS.bit.SOCAPRD = ET_1ST;            // Trigger ePWM1 SOCA on every event
}
//=============================================================================================
// CONFIG : Function Call to configure PWM Module on startup
//=============================================================================================


//=============================================================================================
// CONFIG : Function Call to configure CAN Mailboxes on startup
//=============================================================================================
void InitCAN_MB(void){
    // CAN MSGID Formatting:
    // Bit 31: Contains the CAN address size 0 : 11 bit, 1 : 29 bit
    // Bits 30, 29: Acknowledgment and request config - set both to 0
    // Bit  28:0: CAN address field, bits 28:18 are used for the address when bit 31 is 0 (11-bit address)
    // For 11-bit CAN, use a left bitwise shift of 18

    struct ECAN_REGS ECanaShadow;

    InitECana();    // CAN Bus Configuration

    //Bitshift CAN ID (In Hex) left by 18
    //ECanaMboxes.MBOX0.MSGID.all = 0x04000000;          // Address 0x100
    //ECanaMboxes.MBOX1.MSGID.all = 0x0A000000;          // Address 0x280
    ECanaMboxes.MBOX0.MSGID.all = 0x1A400000;          // Address 0x690
    ECanaMboxes.MBOX1.MSGID.all = 0x1A440000;          // Address 0x691
    ECanaMboxes.MBOX2.MSGID.all = 0x1A480000;          // Address 0x692 - control from system

    // Configure Mailbox under test as a Transmit mailbox
    ECanaShadow.CANMD.all = ECanaRegs.CANMD.all;
    ECanaShadow.CANMD.bit.MD0 = 0;
    ECanaShadow.CANMD.bit.MD1 = 0;
    ECanaShadow.CANMD.bit.MD2 = 1;
    ECanaRegs.CANMD.all = ECanaShadow.CANMD.all;


    // Enable Mailbox
    ECanaShadow.CANME.all = ECanaRegs.CANME.all;
    ECanaShadow.CANME.bit.ME0 = 1;
    ECanaShadow.CANME.bit.ME1 = 1;
    ECanaShadow.CANME.bit.ME2 = 1;
    ECanaRegs.CANME.all = ECanaShadow.CANME.all;


    // Set how many bytes to be transmitted
    ECanaMboxes.MBOX0.MSGCTRL.bit.DLC = 8;
    ECanaMboxes.MBOX1.MSGCTRL.bit.DLC = 8;


}
//=============================================================================================
// CONFIG : Function Call to configure CAN Mailboxes on startup
//=============================================================================================


//=============================================================================================
// ISR : 20kHz Interrupt Service Routine for time critical functions
//=============================================================================================
interrupt void SECONDARY_ISR(void)
{
    EINT;
//-----------------------------------------------------------------------------------------------
//Moved MPPT from 50mS background loop to 20kHz ISR with MPPT_Slew variable increased from 1 to 500

//Following is an implementation of perturb and observe algorithm to track the maximum power point.
//The algorithm is based on re-inforcement learning and continually perturbs the operating point
//observing the change in power and using a reward and punishment based algorithm to get to the maximum power point

//In Solar application, the stage interfacing with the panel tries to regulate its input voltage driven by the panel
//This voltage is calle VpvRef (Note for other than solar application this could be any other parameter)
//The control of the power stage expects a reference in normalized Q24 format
 
//The following code sets the value of VpvRef_MPPT such that it tracks to the MPP
//Perturbation size for the VpvRef_MPPT is kept at 1% of Vmpp, where Vmpp is the MPP panel voltage at nominal operating ocnditions.
 

//The code below uses Gui_PanelPower variable which has been calculated 
//by multiplying the panel voltage and current drawn


    //Gui_PanelPower= _IQ6mpy(Gui_Vp_fb,((int16)Gui_IL_avg>>5));//Q6(16bit)*Q6(16bit) ==>IQMathLib==> Q6 (16bit)

    //Changed Gui Power from Q6 (above) to Q5 (below) to allow power calculation greater than 512Watt.
    //Use Q5 to display Gui_PanelPower on CCS watch window
    Gui_PanelPower= _IQ5mpy(((int16)Gui_Vp_fb>>1),((int16)Gui_IL_avg>>6));//Q5(16bit)*Q5(16bit) ==>IQMathLib==> Q5 (16bit)
    Inv_Gui_PanelPower = Gui_PanelPower>>5;


// Following is the implementation using the solar lib function
    if(Run_MPPT==1)
    {
        // MPPT routine
        mppt_incc1.Ipv = IL_avg;//IpvRead_EMAVG; //IpvRead;
        mppt_incc1.Vpv = Vp_fb_Avg;//VpvRead_EMAVG; //VpvRead;

