matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
        mppt_incc_MACRO(mppt_incc1);

        VpvRef_MPPT = mppt_incc1.VmppOut;

        mppt_pno1.Ipv = IL_avg;//IpvRead_EMAVG; //IpvRead;
        mppt_pno1.Vpv = Vp_fb_Avg;//VpvRead_EMAVG; //VpvRead;

        mppt_pno_MACRO(mppt_pno1);

        //VpvRef_MPPT = mppt_pno1.VmppOut;

        if(VpvRef_MPPT<_IQ24(0.0))
        {
            VpvRef_MPPT=_IQ24(0.0);
        }
        else if(VpvRef_MPPT>_IQ24(0.9))
        {
            VpvRef_MPPT=_IQ24(0.9);
        }

        VpvRef=VpvRef_MPPT;

        Run_MPPT=0;
    }



//MPPT is a slow task, the following code enables to modulate the rate at which the MPPT is called

    if(MPPT_slew==0)
        {
            if(Enable_mppt==1)
            {
                Run_MPPT=1;
                mppt_incc1.mppt_enable=1;
            }
            MPPT_slew=500;
        }
    else
    {
            MPPT_slew--;
            mppt_incc1.mppt_enable=0;
    }

    //Disable MPPT when GPIO pin is active

//----------------------------------------------------------------------------------------------------------
//This section of code is used when the inverter board is connected to the DC-DC board


    if(inverter_connected == 1)//Inverter is connected. This is the default setting. The user must use the GUI
                                //to set this variable to 0 if the inverter is not connected//
    {
        if(GpioDataRegs.GPADAT.bit.GPIO16 == 1)//Check to see if the Inverter has pulled this pin HIGH
        {
            if(GPIO_cnt==5)//Inverter has pulled the GPIO pin HIGH indicating a fault. So wait for 5 count before disabling MPPT
            {

            GPIO_status=1;//Disable MPPT control when GPIO16 is pulled HIGH from the DC-AC Inverter side
            GPIO_cnt = 0;
            }
            GPIO_cnt++;
        }
        //****Check two conditions, "GPIO LOW" AND "COMMS up and running", before turning ON MPPT DC-DC.
        //When the COMMS run, the DC-DC uses the variable Gui_wLLCOutputVolt to know the LLC output volt
        //reported by the DC-AC Inverter, and this variable should be updated to reflect at least 200V

        if((GpioDataRegs.GPADAT.bit.GPIO16 == 0)&& (Gui_wLLCOutputVolt > 2000))//Check to see if the Inverter has pulled this pin LOW and COMMS is running
        {
            //Inverter has pulled the GPIO pin LOW
            //Lower LLC freq to 120kHz when the Inverter has pulled the GPIO pin LOW

            //PWM_ComplPairDB_CNF(3, period_LLC, 1, 0);
            if((*ePWM[3]).TBCTR < (((*ePWM[3]).TBPRD) - 10))
            {
                (*ePWM[3]).TBPRD = period_LLC-1;
                (*ePWM[3]).CMPA.half.CMPA = period_LLC/2;
            }

            GPIO_status=0;//Allow MPPT control by Enable_mppt when GPIO16 is pulled LOW
            GPIO_cnt = 0;
        }
    }

//---------------------------------------------------------------------------------------------------

    if(inverter_connected == 0)//Inverter not connected. The user must use the GUI to set
                               //inverter_connected = 0, implying that the inverter is not connected.
                               //This is required since the default setting is inverter_connected = 1
    {

        //Change the LLC PWM freq close to resonant freq of 120kHz;
        if((*ePWM[3]).TBCTR < (((*ePWM[3]).TBPRD) - 10))
        {
            (*ePWM[3]).TBPRD = period_LLC-1;
            (*ePWM[3]).CMPA.half.CMPA = period_LLC/2;
        }

        if((Start_DC_DC == 1) && (LLC_PWM_ON == 1))
        {
            if(GPIO_cnt==1000)
            {
            GPIO_status=0;//Allow MPPT control
            GPIO_cnt = 0;
            }
            GPIO_cnt++;
        }
        else
        {
            GPIO_status=1;//Disable MPPT control
            GPIO_cnt = 0;
        }
    }

//---------------------------------------------------------------------------------------------------------

    if(GPIO_status==1)//Keep MPPT disabled anytime GPIO_status is 1. This ensures MPPT is disabled
                        //during startup (when GPIO is an input pin and at high level), and under fault condition
        {
            Enable_mppt=0;   //Disable MPPT. This will turn off Boost PWM
            mppt_incc1.mppt_first=1;
            mppt_pno1.mppt_first=1;
            VpvRef=_IQ24(0.9);

            if(Operation_mode==1)//We also need to turn off LLC PWM to prevent OV condition at its output.
                            //But this cannot be done during start up since LLC has to be ON at that time.
                            //So we also check Operation_mode flag (Operation_mode=0=> startup mode,Operation_mode=1=>Run mode) before we turn off LLC PWM
            {
                EALLOW;
                EPwm3Regs.TZFRC.bit.OST = 1;//Turn off LLC PWM when in RUN mode (Operation_mode=1)
                EDIS;
                LLC_PWM_ON = 0;
                Operation_mode=2;//Go to restart mode, Operation_mode=2, and wait for restart command from inverter or the DC-DC GUI

            }
        }

            //************Code added to implement LLC output OV protection ONLY when the inverter is connected.
            //This parameter Gui_wLLCOutputVolt is available from the Inverter side when the Inverter is connected and
            //communicating to DC-DC. Therefore, LLC output will not have OV protection when the DC-DC runs without the Inverter
            if(Gui_wLLCOutputVolt > 4100)
            {
                EALLOW;
                EPwm3Regs.TZFRC.bit.OST = 1;//Turn off LLC PWM when LLC output is 410V
                EDIS;
            }

//------------------------------------------------------------------------------------------------------

    EPwm7Regs.ETCLR.bit.INT = 1;                    // Enable ePWM7 INTN pulse
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;
    return;
}
//=========================================================================================================
//End of 20kHz ISR
//==========================================================================================================

