matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
//-----------------------------------------------------------------------------------------------------------
//RGB control function, each input takes 0-255 input to set brightness for the corresponding LED
void RGBWSetColor(Uint16 redDuty, Uint16 greenDuty, Uint16 blueDuty, Uint16 whiteDuty){
    (*ePWM[4]).CMPA.half.CMPA = redDuty << 6;
    (*ePWM[4]).CMPB = greenDuty << 6;
    (*ePWM[6]).CMPA.half.CMPA = blueDuty << 6;
    (*ePWM[6]).CMPB = whiteDuty << 6;
    return;
}
//-----------------------------------------------------------------------------------------------------------

void RGBModeControl(Uint16 DisplayMode){
    //static Uint16 fade;
    //static Uint16 fade_dir;
    switch(DisplayMode){
    case LED_W_BR:
        RGBWSetColor(0,0,0,fade);
        break;
    case LED_R_BR:
        RGBWSetColor(fade,0,0,0);
        break;
    case LED_G_BR:
        RGBWSetColor(0,fade,0,0);
        break;
    case LED_B_BR:
        RGBWSetColor(0,0,fade,0);
        break;
    case LED_ORG_BR:
        RGBWSetColor(fade>>1,fade>>3,0,0);
        break;
    case LED_CYA_BR:
        RGBWSetColor(0,fade>>1,fade>>1,0);
        break;
    case LED_MAG_BR:
        RGBWSetColor(fade>>1,0,fade>>1,0);
    case LED_YEL_BR:
        RGBWSetColor(fade>>1,fade>>1,0,0);
        break;
    case LED_R_FL:
        RGBWSetColor(7<<(fade&128),0,0,0);//Bitmap to flash 1x per direction
        break;
    }
    //Update fade counter
    if(!fade_dir){
        fade++;
    }
    else{
        fade--;
    }

    //Update fade direction
    if(fade == 255){
        fade_dir = 1;
    }
    else if(fade == 0){
        fade_dir = 0;
    }


}

//===========================================================================================================
//  STATE-MACHINE SEQUENCING AND SYNCRONIZATION
//===========================================================================================================

//--------------------------------- FRAMEWORK -------------------------------------
void A0(void)
{
    // loop rate synchronizer for A-tasks
    if(CpuTimer0Regs.TCR.bit.TIF == 1)
    {
        CpuTimer0Regs.TCR.bit.TIF = 1;  // clear flag

        //-----------------------------------------------------------
        (*A_Task_Ptr)();        // jump to an A Task (A1,A2,A3,...)
        //-----------------------------------------------------------

        SerialCommsTimer++;

        VTimer0[0]++;           // virtual timer 0, instance 0 (spare)
    }

    Alpha_State_Ptr = &B0;      // Comment out to allow only A tasks
}

void B0(void)
{
    // loop rate synchronizer for B-tasks
    if(CpuTimer1Regs.TCR.bit.TIF == 1)
    {
        CpuTimer1Regs.TCR.bit.TIF = 1;              // clear flag

        //-----------------------------------------------------------
        (*B_Task_Ptr)();        // jump to a B Task (B1,B2,B3,...)
        //-----------------------------------------------------------
        VTimer1[0]++;           // virtual timer 1, instance 0 (spare)
    }

    Alpha_State_Ptr = &C0;      // Allow C state tasks
}

void C0(void)
{
    // loop rate synchronizer for C-tasks
    if(CpuTimer2Regs.TCR.bit.TIF == 1)
    {
        CpuTimer2Regs.TCR.bit.TIF = 1;              // clear flag

        //-----------------------------------------------------------
        (*C_Task_Ptr)();        // jump to a C Task (C1,C2,C3,...)
        //-----------------------------------------------------------
        VTimer2[0]++;           //virtual timer 2, instance 0 (spare)
    }

    Alpha_State_Ptr = &A0;  // Back to State A0
}


//=================================================================================
//  A - TASKS
//=================================================================================
//--------------------------------------------------------
void A1(void) 
//--------------------------------------------------------
{

    if (INCR_BUILD == 3)
    {
        //if(LedBlinkCnt==0)
         //{
            GpioDataRegs.GPACLEAR.bit.GPIO18 = 1; // Set Low to let the Inverter know that the DC-DC is ON (for BUILD 3)
         //}
         //else
         //{
         // GpioDataRegs.GPASET.bit.GPIO18 = 1;//Use for test only
         //}

        inverter_mode = inverter_connected;//Update inverter status (connected/not connected) only for GUI reporting//

        if((Operation_mode == 0) && (LLC_PWM_ON == 0))
        {
            EALLOW;
            EPwm3Regs.TZCLR.bit.OST = 1;//Clear TZ and turn on LLC PWM when in START UP mode
            EDIS;

            //Code modification below for SS**********
            //LLC_PWM_ON = 1;//Moved this LLC_PWM_ON flag setting(for inverter connected mode)after soft-start is complete
            if(inverter_connected == 0)
            {
            LLC_PWM_ON = 1;
            }
            //end SS mods******************************
        }

    }

    //-------------------
    //the next time CpuTimer0 'counter' reaches Period value go to A2
    A_Task_Ptr = &A2;
    //-------------------
}

//-----------------------------------------------------------------
void A2(void) 
//-----------------------------------------------------------------
{
    SerialHostComms();  // Uncomment for FLASH config

    LinDebugTimer++;
/*
    //check Lin error
    if(LinaRegs.SCIFLR.bit.BE == 1 ||LinaRegs.SCIFLR.bit.PE == 1 || LinaRegs.SCIFLR.bit.BRKDT == 1|| LinaRegs.SCIFLR.bit.OE == 1)
    {
        if(LinDebugTimer == 100)
        {
            LinDebugTimer = 0;
            if(LinDebugLED <= 0)
            {
                GpioDataRegs.GPADAT.bit.GPIO31 = 0;//mModeLed_ON();
                LinDebugLED = 1;
            }
            else if(LinDebugLED >= 1)
            {
                GpioDataRegs.GPADAT.bit.GPIO31 = 1;//mModeLed_OFF();
                LinDebugLED = 0;
            }
        }
    }
*/

//****************************************************
//Add soft-start for LLC, only for Build 3. Move on to A3 when soft-start is over. Otherwise go back to A1

    if((INCR_BUILD == 3) && (soft_start == 0))
    {
        //Soft-start is not complete
        if((*ePWM[3]).TBCTR < (((*ePWM[3]).TBPRD) - 10))
        {
            (*ePWM[3]).DBFED = dbred;
            (*ePWM[3]).DBRED = dbred;
        }

        if(dbred > 25)
        {
            if(db_dly_cntr == 100)
            {
                dbred = dbred-2;
                db_dly_cntr=0;
            }
            else
            {
                db_dly_cntr++;
            }
        }
        else
        {
            if((*ePWM[3]).TBCTR < (((*ePWM[3]).TBPRD) - 10))
            {
                (*ePWM[3]).DBFED = 25;
                (*ePWM[3]).DBRED = 25;
                LLC_PWM_ON = 1;//LLC stage is ON
                soft_start = 1;//Soft-start is complete
            }
         }

