matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
        A_Task_Ptr = &A1;
    }
    else
    {
        A_Task_Ptr = &A3;
    }
//End of soft-start code************************


    //-------------------
    //the next time CpuTimer0 'counter' reaches Period value go to A1

    //A_Task_Ptr = &A3;//Commented this to test soft-start
    //-------------------


}

//-----------------------------------------------------------------
void A3(void) 
//-----------------------------------------------------------------
{
    if(INCR_BUILD == 3)
    {
        //When the DC-DC runs without the Inverter, check for min panel voltage before starting MPPT DC-DC.
        //When DC-DC Runs with the Inverter connected, this flag (Start_DC_DC) is not used. Another GPIO (GPIO16)
        //enable signal is then used (activated by the Inverter) to start the DC-DC.
        if(Vp_fb_Avg >= VPV_MIN)
        {

            Start_DC_DC=1;//Start DC-DC MPPT provided LLC PWM is ON(This is checked in the 20kHz SECONDARY ISR)

            //***********************************************************************************
            //To control the variable "Start_DC_DC" from CCS watch window and run the DC-DC code with external 12V bias (not using PR798 bias supply)
            //COMMENT OUT the line above. This will allow code to run with MPPT off; Then the user will apply panel volt and start MPPT
            //from CCS watch window by setting Start_DC_DC = 1
            //************************************************************************************
        }
        else
        {
            Start_DC_DC = 0;//Do not start DC-DC MPPT
        }

        //if(GpioDataRegs.GPADAT.bit.GPIO16 == 0)
        if(GPIO_status == 0)
        {
            A_Task_Ptr = &A4;//Go to State A4 to turn ON MPPT
        }
        else
        {
        //-------------------
        //the next time CpuTimer0 'counter' reaches Period value go to A1
        A_Task_Ptr = &A1;
        //-------------------
        }

    }

    A_Task_Ptr = &A4;
}

//-----------------------------------------------------------------
void A4(void) 
//-----------------------------------------------------------------
{
    if(INCR_BUILD == 3)
    {

        //inverter_mode = inverter_connected;

        //if(GpioDataRegs.GPADAT.bit.GPIO16 == 0)
        if(GPIO_status == 0)
        {
            Enable_mppt=1;   //Enable MPPT.
            Operation_mode=1;
            A_Task_Ptr = &A1;
        }
    }

    //-------------------
    //the next time CpuTimer0 'counter' reaches Period value go to A1
    A_Task_Ptr = &A1;
    //-------------------

}

//=================================================================================
//  B - TASKS
//=================================================================================

//----------------------------------- USER ----------------------------------------

//----------------------------------------
void B1(void)
//----------------------------------------
{
    HistPtr++;
    if (HistPtr >= HistorySize)
        HistPtr = 0;

    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //----------------------------------------------------------------
    //Hist_IL[HistPtr] = ILR;
    Hist_IL[HistPtr] = IL_avg >> 12;//IL_avg is in Q24. So convert to Q12
    Hist_Vb_fb[HistPtr] = Vb_fbR;
    Hist_Vp_fb[HistPtr] = Vp_fbR;

    // Measurements
    //----------------------------------------------------------------
    // view following variables in Watch Window as:
    //      Gui_IL = Q??
    //      Gui_Vb_fb = Q??
    //      Gui_Vp_fb = Q??

    //Average Boost Voltage Calculation
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vb_fb[i];    //Q12 * 8 = Q15
    Gui_Vb_fb = ((long)temp_Scratch*(long)K_Vb_fb) >> 15;   //Q15*Q15 >> 15 = Q15

    //Average Panel Voltage Calculation
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vp_fb[i];    //Q12 * 8 = Q15
    Gui_Vp_fb = ((long)temp_Scratch*(long)K_Vp_fb) >> 15;   //Q15*Q15 >> 15 = Q15
    
    //Average Cuurent calculation
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_IL[i];   //Q12 * 8 = Q15
    Gui_IL_avg = ((long)temp_Scratch*(long)K_IL_avg) >> 15; //Q15*Q15 >> 15 = Q15


    struct ECAN_REGS ECanaShadow;

    //Send Panel Input Voltage, Current, Power
    ECanaMboxes.MBOX0.MDL.all = ((unsigned long)Gui_Vb_fb << 16) + (Uint16)Gui_Vp_fb;     //byte3,byte2,byte1,byte0
    ECanaMboxes.MBOX0.MDH.all = ((unsigned long)Gui_PanelPower << 16) + (Uint16)Gui_IL_avg; //byte7,byte6,byte5,byte4

    //Send Operation mode, thermal probes
    ECanaMboxes.MBOX1.MDL.all = ((unsigned long)HTSK_TP << 16) + (Uint16)Operation_mode;     //byte3,byte2,byte1,byte0
    ECanaMboxes.MBOX1.MDH.all = EXTHTSK_TP;                                                 //byte7,byte6,byte5,byte4

    ECanaShadow.CANTRS.all = 0;
    ECanaShadow.CANTRS.bit.TRS0 = 1;     // Set TRS for transmitting mailbox
    ECanaShadow.CANTRS.bit.TRS1 = 1;     // Set TRS for transmitting mailbox
    ECanaRegs.CANTRS.all = ECanaShadow.CANTRS.all;


    //-----------------
    //the next time CpuTimer1 'counter' reaches Period value go to B2
    B_Task_Ptr = &B2;
    //-----------------
}

//----------------------------------------
void B2(void) // Blink LED on the control CArd
//----------------------------------------
{
    struct ECAN_REGS ECanaShadow;


        //Check acknowledgment of CAN messages
        if(ECanaRegs.CANTA.bit.TA0 == 0 ){                  //Not acknowledged
            if(CAN_noACK < CAN_MAX_UNACK+10)CAN_noACK++;
            ECanaShadow.CANTA.all = ECanaRegs.CANTA.all;
        }
        else{
            CAN_noACK = 0;
            ECanaShadow.CANTA.all = 0;
            ECanaShadow.CANTA.bit.TA0 = 1;                  // Clear TA5
            ECanaShadow.CANTA.bit.TA1 = 1;
            ECanaRegs.CANTA.all = ECanaShadow.CANTA.all;
        }

        if(ECanaShadow.CANRMP.bit.RMP2 == 1){
            ECanaShadow.CANRMP.bit.RMP2 = 0;
            LedBlinkCnt = 16383;
        }


    if(LedBlinkCnt==0)
        {
            //GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;    //turn on/off LD3 on the controlCARD
            LedBlinkCnt=5;
        }
    else
            LedBlinkCnt--;

    //-----------------
    //the next time CpuTimer1 'counter' reaches Period value go to B1
    B_Task_Ptr = &B1;
    //-----------------
}


