matthewpanizza/SolarPack-MPPT/Solar_DC_DC_F2806x/HV_Solar_DC_DC-Main.c
//=================================================================================
//  C - TASKS
//=================================================================================

//--------------------------------- USER ------------------------------------------

//------------------------------------------------------
void C1(void)  // LED Status Control
//------------------------------------------------------
{


    if(Operation_mode == 0){
        if(CAN_noACK < CAN_MAX_UNACK) ledSetMode = LED_W_BR;
        else ledSetMode = LED_B_BR;
    }
    else if(Operation_mode == 1){
        if (HTSK_TP > HTSK_OHVAL) ledSetMode = LED_MAG_BR;
        else if(CAN_noACK >= CAN_MAX_UNACK) ledSetMode = LED_G_BR;
        else ledSetMode = LED_CYA_BR;
    }
    else if(Operation_mode == 2){
        if (HTSK_TP > HTSK_OHVAL) ledSetMode = LED_R_FL;
        else if(CAN_noACK < CAN_MAX_UNACK) ledSetMode = LED_ORG_BR;
        else ledSetMode = LED_R_BR;
    }

    RGBModeControl(ledSetMode);

    //-----------------
    //the next time CpuTimer2 'counter' reaches Period value go to C2
    C_Task_Ptr = &C1;
    //-----------------
}
//----------------------------------------
void C2(void) //
//----------------------------------------
{
    //-----------------
    //the next time CpuTimer2 'counter' reaches Period value go to C1
        C_Task_Ptr = &C1;
    //-----------------
}


//-----------------------------------------
void C3(void) // 
//-----------------------------------------
{
    //-----------------
    //the next time CpuTimer2 'counter' reaches Period value go to C1
        C_Task_Ptr = &C1;
    //-----------------

}
